Revit 2026 API

# MetalPerforationsType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetalPerforations" from the "Metal" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetalPerforationsType
```
```vb
Public Enumeration MetalPerforationsType
```
```cpp
public enum class MetalPerforationsType
```
```fsharp
type MetalPerforationsType
```

| Member name | Value | Description |
| --- | --- | --- |
| CirclesStaggered | 1 |  |
| CirclesStraight | 2 |  |
| Cloverleaf | 5 |  |
| Custom | 7 |  |
| Grecian | 4 |  |
| Hexagon | 6 |  |
| None | 0 |  |
| Squares | 3 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace